examples/cylinder2D_openfoam/fluid-openfoam/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  com                                   |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    arch        "LSB;label=32;scalar=64";
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    "(cylinder_wall|top|bottom)"
    {
        type            noSlip;
    }
    
    cylinder_jet1
    {
        type            cylindricalSinusoidalProfile2D;
        origin        (0 0 0.005);
        axis          (1.0 0.0 0.005);
        theta0        90;
        w             10;
        volumetricFlowRate  constant 0.00001;
        value           uniform (0 0 0);
    }

    cylinder_jet2
    {
        type          cylindricalSinusoidalProfile2D;
        origin        (0 0 0.005);
        axis          (1.0 0.0 0.005);
        theta0        90;
        w             10;
        volumetricFlowRate  constant -0.00001;
        value           uniform (0 0 0);
    }

    "(front|back)"
    {
        type            empty;
    }
}


// ************************************************************************* //
