examples/cylinder2D_openfoam/fluid-openfoam/system/integrateOnSurfaceDict
functions
{
    flux
    {
        functionObjectLibs ("libfieldFunctionObjects.so");
        type             surfaceFieldValue;

        enabled          true;
        writeControl     outputTime;
        writeInterval    1;
        writeFields      false;

        name myName;

        // regionType: patch/faceZone/sampledSurface
        regionType sampledSurface;

        sampledSurfaceDict
        {
            type                  plane;
            planeType             pointAndNormal;
            pointAndNormalDict
            {
                point  (0.1 0 0);
                normal (1 0 0);
            };
            interpolate false;
        }

        // Operation: areaAverage/sum/weightedAverage/...
        operation    areaNormalIntegrate;
        fields
        (
            U
        );
    }
}